/*
 * FloppyDisk.h - PPC SWIM Floppy disk device class
 *
 * Main class for SWIM floppy disk devices
 */

#import <driverkit/IODisk.h>
#import <driverkit/return.h>
#import <mach/vm_types.h>

// Forward declaration
typedef struct _FdBuffer FdBuffer;
typedef struct _QueueHead {
    FdBuffer *first;
    FdBuffer *last;
} QueueHead;

@interface FloppyDisk : IODisk
{
    // Queue management (offsets 0x184-0x194)
    QueueHead _priorityQueue;         // offset 0x184: High priority I/O queue
    QueueHead _normalQueue;           // offset 0x18c: Normal priority I/O queue
    id _queueLock;                    // offset 0x194: Lock for queue operations
    id _controller;                   // offset 0x198: Floppy controller reference
    unsigned int _innerRetry;         // offset 0x19c: Inner retry count
    unsigned int _outerRetry;         // offset 0x1a0: Outer retry count
    unsigned char _reserved1[8];      // offset 0x1a4-0x1ab: reserved
    unsigned int _timerFlags;         // offset 0x1ac: Timer flags (bit 31)
    unsigned char _reserved2[4];      // offset 0x1b0-0x1b3: reserved
    const char *_driveInfo;           // offset 0x1b4: Drive info string
    unsigned char _reserved3[8];      // offset 0x1b8-0x1bf: reserved

    // Drive state (offsets 0x1c8-0x1eb)
    unsigned int _field_0x1c8;        // offset 0x1c8: unknown
    unsigned int _density;            // offset 0x1cc: Media density (1=500kbps, 2=300kbps, 3=1Mbps)
    unsigned int _capacity;           // offset 0x1d0: Disk capacity
    unsigned int _isFormatted;        // offset 0x1d4: Formatted flag
    unsigned int _blockSize;          // offset 0x1d8: Block size in bytes
    unsigned int _gapLength;          // offset 0x1dc: Gap length
    unsigned int _sectorsPerTrack;    // offset 0x1e0: Sectors per track
    unsigned int _sectorSizeCode;     // offset 0x1e4: Sector size code
    unsigned int _field_0x1e8;        // offset 0x1e8: unknown
    void *_buffer;                    // offset 0x1ec: Buffer pointer

    // Additional fields from earlier offsets
    unsigned char _headsPerCylinder;  // offset 0x1bc: heads per cylinder
    unsigned char _field_0x1d7;       // offset 0x1d7: additional flag
}

// Public methods
- (IOReturn)_abortRequest;
- (IOReturn)_deviceClose;
- (IOReturn)_deviceOpen:(BOOL)exclusive;
- (void)_diskBecameReady;
- (IOReturn)_ejectPhysical;
- (IOReturn)_innerRetry;
- (BOOL)_isDiskReady:(id)controller;
- (BOOL)_needsManualPolling;
- (IOReturn)_outerRetry;
- (IOReturn)_property_IODeviceType:(char *)types length:(unsigned int *)maxLen;
- (IOReturn)_property_IOUnit:(unsigned int *)unit length:(unsigned int *)length;
- (IOReturn)readAsyncAt:(unsigned)offset length:(unsigned)length buffer:(void *)buffer pending:(void *)pending client:(vm_task_t)client;
- (IOReturn)readAt:(unsigned)offset length:(unsigned)length buffer:(void *)buffer actualLength:(unsigned *)actualLength client:(vm_task_t)client;
- (IOReturn)_updatePhysicalParameters;
- (void)_updateReadyState;
